# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*
# 385916 -> yes
# 123456 -> no

a = str(input("Введите число: "))
if len(a) == 6:
  b = (int(a[0]) + int(a[1]) + int(a[2]))
  c = (int(a[3]) + int(a[4]) + int(a[5]))
  if b == c:
    print("YES")
  else:
    print("NO")
else:
  print("Номер билета должен состоять из 6и цифр!")